#!/usr/bin/env python
#-*- coding: utf-8 -*-
'''
@File  : python的if语句.py
@Date  : 2019/11/15 0015 16:12
@Author: xibei
'''


''' 控制语句 '''

# 控制语句： 条件语句，循环语句

'''条件语句'''
# 条件语句： 根据不同的条件 对 不同的情况 做出不同的处理
# 关键字： if elif else
# python中：符号就需要缩进换行
# 条件语句的格式：
#   if 条件表达式 ：
#       需要执行的代码
#   elif 条件表达式：
#       需要执行的代码
#   else：                       # else不可以有条件表达式，且else可以不存在
#       需要执行的代码

# 注意：条件表达式值都是布尔值
#      表达式为true才会执行if下面的代码
#      所有为空为零的数据放在if后面会判断为false
#      所有非空非零的数据反正if后面会判断为true
#      在一个语句中最多只能有一个else，elif可以有多个
